<?php 
// Heading
$_['heading_title'] = 'Пошукова система з морфологією та релевантністю v4.1 [<a href="http://sv2109.com" target="_blank">sv2109.com</a>]';

// Entry
$_['entry_status'] = 'Статус';
$_['entry_field'] = 'Поле';
$_['entry_join'] = 'JOIN для нової таблиці';
$_['entry_where'] = 'WHERE для нової таблиці';
$_['entry_transliteration'] = 'Транслітерація';
$_['entry_fix_keyboard_layout'] = 'Виправляти розкладку клавіатури';
$_['entry_inexact_search'] = 'Неточний пошук';
$_['entry_inexact_search_limit'] = 'Точність неточного пошуку';
$_['entry_simple_inexact_search_length'] = 'Довжина слова для спрощеного неточного пошуку';
$_['entry_base_search'] = 'Основний пошук';
$_['entry_search_type_order'] = 'Сортування типів пошуку';
$_['entry_search_type'] = 'Тип пошуку';
$_['entry_search_type_sort'] = 'Сортування';
$_['entry_sort_order_stock'] = 'Враховувати наявність на складі';
$_['entry_sort_order_stock_statuses'] = 'Враховувати наявність на складі для цих статусів';
$_['entry_search_whole_word'] = 'Пошук за цілим словом';
$_['entry_fields_name'] = 'Поля';
$_['entry_search'] = 'Де шукати';
$_['entry_parts_of_speech_filter']= 'Фільтр частинами мови';
$_['entry_part_of_speech'] = 'Частина мови';
$_['entry_search_logic'] = 'Логіка пошуку для фраз із кількох слів';
$_['entry_min_word_length'] = 'Мінімальна довжина слова для пошуку';
$_['entry_cache_results'] = 'Кешувати результати пошуку';
$_['entry_relevance_start'] = 'Вага першого слова';
$_['entry_relevance_end'] = 'Вага останнього слова';
$_['entry_contains'] = 'Пошук за входженням слова';
$_['entry_key'] = 'Ключ';
$_['entry_exclude_words'] = 'Виключити слова';
$_['entry_synonyms'] = 'Синоніми';
$_['entry_replace_words'] = 'Замінити слова';
$_['entry_ignore_language']     = 'Пошук без врахування мови';
$_['entry_switch_from_and_to_or'] = 'Переключати логіку пошуку';
$_['entry_and_coefficient'] = 'Коефіцієнт для логіки І';
$_['entry_max_execution_time'] = 'Максимальний час виконання пошукового запиту, ms';
$_['entry_multistore'] = 'Мультимагазин';
$_['entry_date_available'] = 'Використовувати дату надходження товарів';
$_['entry_progress'] = 'Індексування';
$_['entry_category'] = 'Категорія';
$_['entry_manufacturer'] = 'Бренд';
$_['entry_coefficient'] = 'Коефіцієнт';
$_['entry_attribute'] = 'Характеристики';
$_['entry_attribute_group'] = 'Група характеристик';
$_['entry_attribute_name'] = 'Назва характеристики';
$_['entry_attribute_value'] = 'Значення характеристики';

// Text
$_['text_module'] = 'Модулі';
$_['text_success'] = 'Модуль успішно оновлений!';
$_['text_success_index'] = 'Індекси створені!';
$_['text_success_delete'] = 'Індекси видалені!';
$_['text_index_progress'] = 'Виконано на <b>%.2f%%</b>';
$_['text_edit'] = 'Редагувати';
$_['text_always'] = 'Завжди';
$_['text_nothing_found'] = 'Коли нічого не знайдено';
$_['text_logic_or'] = 'АБО';
$_['text_logic_and'] = 'І';
$_['text_stock_end'] = 'Наприкінці результатів';
$_['text_stock_remove'] = 'Виключити з результатів';
$_['text_confirm'] = 'Ви впевнені?';
$_['text_simple_inexact_search'] = 'Спрощений режим';

$_['text_NOUN'] = 'Іменник (телефон)';
$_['text_ADJ_FULL'] = 'Прикметник (червоний)';
$_['text_ADJ_SHORT'] = 'Короткий прикметник (гарна)';
$_['text_INFINITIVE'] = 'Інфінітив (йти)';
$_['text_VERB'] = 'Дієслово в особистій формі (іде )';
$_['text_ADVERB_PARTICIPLE'] = 'Дієпричастя (ідучи)';
$_['text_PARTICIPLE'] = 'Причастя (що йде)';
$_['text_PARTICIPLE_SHORT'] = 'Коротке причастя (побудована)';
$_['text_NUMERAL'] = 'Чисельне (кількісне) (вісім)';
$_['text_NUMERAL_P'] = 'Порядковий чисельний (восьмий)';
$_['text_PRONOUN'] = 'Заголовок-іменник (він)';
$_['text_PRONOUN_PREDK'] = 'Займенник-предикатив (нічого)';
$_['text_PRONOUN_P'] = 'Займенник прикметник (кожний)';
$_['text_ADV'] = 'Прислівник (круто)';
$_['text_PREDK'] = 'Предикатив (цікаво)';
$_['text_PREP'] = 'Прийменник (під )';
$_['text_CONJ'] = 'Союз (і)';
$_['text_INTERJ'] = 'Міжметеє ( ой )';
$_['text_PARTICLE'] = 'Частина (а, б)';
$_['text_INP'] = 'Вступне слово (звісно)';
$_['text_PHRASE'] = 'Фразеологізм (бухти-барахти, зги)';

// Tabs
$_['tab_general'] = 'Налаштування';
$_['tab_additional'] = 'Додатково';
$_['tab_field'] = 'поля';
$_['tab_support'] = 'Підтримка';
$_['tab_exclude_words'] = 'Виключити слова';
$_['tab_synonyms'] = 'Синоніми';
$_['tab_replace_words'] = 'Замінити слова';
$_['tab_add_fields'] = 'Додати поля';
$_['tab_categories'] = 'Категорії';
$_['tab_manufacturers'] = 'Бренди';
$_['tab_parts_of_speech'] = 'Частини мови';

// Fields
$_['field_pd.name'] = 'Назва';
$_['field_pd.description'] = 'Опис';
$_['field_pd.tag'] = 'Теги';
$_['field_pa.text'] = 'Атрибути';
$_['field_p.model'] = 'Модель';
$_['field_p.sku'] = 'SKU';
$_['field_p.upc'] = 'UPC';
$_['field_p.ean'] = 'EAN';
$_['field_p.jan'] = 'JAN';
$_['field_p.isbn'] = 'ISBN';
$_['field_p.mpn'] = 'MPN';

// Buttons
$_['button_add'] = 'Створити індекси';
$_['button_delete'] = 'Видалити всі індекси';
$_['button_stop_hide'] = 'Зупинити/Приховати';
$_['button_category_add'] = 'Додати категорію';
$_['button_manufacturer_add'] = 'Додати бренд';

// Error
$_['error_permission'] = 'Увага: Ви не маєте права модифікувати модуль Пошукова система з морфологією та релевантністю!';
$_['error_field'] = 'Нове поле для пошуку не може бути порожнім';
$_['error_warning'] = 'Уважно перевірте форму на помилки!';
$_['error_inexact_search'] = 'Неточний пошук, схоже, не підтримується. Потрібен MySQL сервер версії 5.7.6 та вище %s. Буде використовуватися спрощений режим';
$_['error_inexact_search_mariadb'] = '(не MariaDB)';

// Help
$_['help_tab_general'] = '';
$_['help_tab_additional'] = 'Додаткові налаштування пошуку<br/> Бажано тут нічого не змінювати, налаштування за замовчуванням підійдуть для більшості сайтів';
$_['help_tab_field'] = 'Допомога:<br/>
    <ul>
      <li>після зміни налаштувань потрібно оновити ідекси</li>
      <li>ваги слів розраховуються пропорційно від першого до останнього, чим ближче слово до початку тим більше в нього вага</li>
      <li>вага останнього слова зазвичай повинна бути меншою за вагу першого</li>
      <li>неточний пошук: ця опція використовується для спрощеного неточного пошуку, бажано використовувати її тільки для невеликих полів (назва товару, модель, артикул..), для великих полів таких як опис товару з великою кількістю тексту це збільшить розмір індексу та швидкість індексування</li>
    </ul>';
$_['help_tab_attributes'] = 'Якщо атрибути не додані, то будуть індексуватися всі атрибути, якщо додані лише додані';    
$_['help_tab_synonyms'] = 'Кожна група синонімів у новому рядку, роздільник слів - пробіл. Наприклад: телефон смартфон';
$_['help_tab_exclude_words'] = 'Одне слово або кілька слів (для виключення фрази) на рядок';
$_['help_tab_replace_words'] = 'Одна пара слів або фраз на рядок, слова в парі розділені пробілом або символом | для фраз. Наприклад: aple apple або big aple | big apple ';
$_['help_tab_add_fields'] = 'Допомога:<br/>
    <ul>
      <li><b>Поле:</b> поле, за яким Ви хочете здійснювати пошук, наприклад: p.product_id, pd.meta_title, pa.text і т.д.</li>
      <li><b>JOIN для нової таблиці: </b> SQL код для додавання нової таблиці, наприклад: "LEFT JOIN oc_product_attribute pa ON (p.product_id=pa.product_id)" <br />
Ось перелік полів, які вже використовуються у модулі, їх не потрібно додавати:
<ul>
<li>product p</li>
<li>product_description pd</li>
<li>product_attribute pa (якщо активовано пошук за атрибутами)</li>
<li>category_path cp (якщо увімкнено шукати в підкатегоріях)</li>
<li>product_to_category p2c (якщо увімкнено шукати в категорії)</li>
<li>product_to_store p2s</li>
</ul>
</li>
<li><b>WHERE для нової таблиці: </b> SQL код для умови WHERE для нової таблиці, наприклад: "pa.language_id = pd.language_id"</li>
<li>Після додавання нового поля збережіть налаштування та змініть налаштування для цього поля у вкладці "Налаштування полів"</li>
    </ul>';
$_['help_tab_categories'] = 'Допомога:<br/>
    <ul>
      <li>Після зміни налаштувань потрібно оновити ідекси</li>
      <li>Коефіцієнт може бути як дробове число, напр.: 0.3 або 1.2 так і ціле, напр.: 2 </li>
<li>Вага кожного товару в цій категорії або бренду множитиметься на цей коефіцієнт</li>
      <li>Якщо вказати коефіцієнт - 0 то товари з цієї категорії зовсім не потраплять до індексу</li>
      <li>Якщо вказати коефіцієнт - 1, то він ніяк не вплине на вагу слів і результат пошуку, тому що будь-яке число при множенні на 1 дає те саме число</li>
      <li>Якщо один товар має більше однієї категорії з коефіцієнтами, то братиметься той, який більше</li>
      <li>Якщо один товар має і категорію з коефіцієнтом і бренд, то їх коефіцієнти будуть множитися</li>
    </ul>';

$_['help_tab_parts_of_speech'] = 'Допомога:<br/>
    <ul>
      <li>Для тих полів, де включений фільтр у частині мови, ваги всіх слів цієї частини промови будуть множитися на цей коефіцієнт</li>
      <li>Після зміни налаштувань потрібно оновити ідекси</li>
      <li>Коефіцієнт може бути як дробове число, напр.: 0.3 або 1.2 так і ціле, напр.: 2 </li>
      <li>Якщо вказати коефіцієнт - 0 то слова цієї частини мови зовсім не потраплять до індексу</li>
      <li>Якщо вказати коефіцієнт - 1 слово потрапить в індекс без зміни ваги</li>
      <li>Працює лише для російської мови</li>
    </ul>';

$_['help_search_logic'] = 'При логіці І будуть знайдені товари, де є всі слова з пошуку, при логіці АБО - товари, де є хоча б одне слово';
$_['help_ignore_language'] = 'Для мультимовних сайтів пошук буде здійснюватися без урахування мови';
$_['help_transliteration'] = 'Використовувати транслітерацію: аппле -> apple';
$_['help_fix_keyboard_layout'] = 'Виправляти неправильну розкладку клавіатури, наприклад: yjen,er->ноутбук';
$_['help_inexact_search'] = 'Пошук з помилками та граматичними помилками.';
$_['help_switch_from_and_to_or'] = 'Переключення логіки пошуку з І на АБО';
$_['help_search_type_order'] = 'Новий тип пошуку запускається, коли попередній нічого не знайшов';
$_['help_sort_order_stock'] = 'Товари, яких немає в наявності, будуть відображатися останніми або виключені з результатів';
$_['help_search_whole_word'] = 'Замість пошуку по кореням слів буде здійснюватися пошук за точним збігом слова.';

$_['help_support'] = '<br />
<b>Якщо у вас виникли проблеми зі встановленням або використанням цього модуля, то ви можете:</b>
<ul>
  <li>Написати мені <a href="mailto:sv2109@gmail.com?subject=Search Engine module">sv2109@gmail.com</a></li>
  <li>Створити тикет <a href="http://sv2109.com/ua/tickets">http://sv2109.com/ru/tickets</a></li>
  <li>Написати коментар на сторінці модуля</li>
</ul>
<br/>
<b>Ви також можете до мене звернутися, якщо:</b>
<ul>
  <li>вам потрібна допомога з вашим OpenCart-ом</li>
  <li>вам потрібно створити будь-який інший модуль для OpenCart</li>
</ul>
<br/>
<div style="font-size: 150%;">Інші корисні модулі ви можете знайти <a href="http://sv2109.com/ua/modules">тут</a>:</div>
<br/>
<a href="http://sv2109.com/ua/modules"><img src="http://sv2109.com/i/ssb.png" alt=""><img src="http:/ /sv2109.com/i/srb.png" alt=""><img src="http://sv2109.com/i/isb.png" alt=""><img src="http://sv2109 .com/i/fcsb.png" alt="">
<br/><img src="http://sv2109.com/i/acb.png" alt=""><img src="http://sv2109.com/i/asb.png" alt=" "><img src="http://sv2109.com/i/iocb.png" alt=""><img src="http://sv2109.com/i/tab.png" alt=""> </a>
';